isundaylee/nRF5/apps/gateway/src/main.c
#include <stdio.h>

#include "app_error.h"
#include "nrf_delay.h"
#include "nrf_gpio.h"

#include "access_config.h"

#include "mesh_app_utils.h"
#include "mesh_stack.h"
#include "ble_softdevice_support.h"

#include "nrf_mesh_events.h"

#include "net_state.h"

#include "configurator.h"
#include "custom_log.h"
#include "provisioner.h"

#include "debug_pins.h"

#define PIN_LED_ERROR 27
#define PIN_LED_INDICATION 28

void app_error_fault_handler(uint32_t id, uint32_t pc, uint32_t info) {
  error_info_t *error_info = (error_info_t *)info;

  nrf_gpio_cfg_output(PIN_LED_ERROR);
  nrf_gpio_pin_set(PIN_LED_ERROR);

  LOG_ERROR("Encountered error %d on line %d in file %s", error_info->err_code,
            error_info->line_num, error_info->p_file_name);

  NRF_BREAKPOINT_COND;
  while (1) {
  }
}

void mesh_assertion_handler(uint32_t pc) {
    assert_info_t assert_info = {.line_num = 0,
                                 .p_file_name = (uint8_t *)""};

    app_error_fault_handler(NRF_FAULT_ID_SDK_ASSERT, pc, (uint32_t)(&assert_info));

    UNUSED_VARIABLE(assert_info);
}

static void init_leds() {
  nrf_gpio_cfg_output(PIN_LED_ERROR);
  nrf_gpio_cfg_output(PIN_LED_INDICATION);
}

static void init_logging() {
  __LOG_INIT(LOG_SRC_APP | LOG_SRC_BEARER | LOG_SRC_ACCESS, LOG_LEVEL_DBG1,
             log_callback_custom);
  LOG_INFO("Hello, world!");
}

static void config_server_evt_cb(config_server_evt_t const *evt) {}

static void init_mesh() {
  // Initialize the softdevice
  ble_stack_init();
  LOG_INFO("Mesh soft device initialized.");

  // Initialize the Mesh stack
  nrf_clock_lf_cfg_t lfc_cfg = {.source = NRF_CLOCK_LF_SRC_XTAL,
                                .rc_ctiv = 0,
                                .rc_temp_ctiv = 0,
                                .accuracy = NRF_CLOCK_LF_ACCURACY_20_PPM};
  mesh_stack_init_params_t mesh_init_params = {
      .core.irq_priority = NRF_MESH_IRQ_PRIORITY_LOWEST,
      .core.lfclksrc = lfc_cfg,
      .models.config_server_cb = config_server_evt_cb};
  bool provisioned;
  APP_ERROR_CHECK(mesh_stack_init(&mesh_init_params, &provisioned));

  LOG_INFO("Mesh stack initialized.");

  // Print out the device MAC address
  ble_gap_addr_t addr;
  APP_ERROR_CHECK(sd_ble_gap_addr_get(&addr));

  LOG_INFO("Device address is %2x:%2x:%2x:%2x:%2x:%2x", addr.addr[0],
           addr.addr[1], addr.addr[2], addr.addr[3], addr.addr[4],
           addr.addr[5]);
}

static void prov_success_cb(uint16_t addr) {
  static conf_step_t steps[] = {
      {
          .type = CONF_STEP_TYPE_COMPOSITION_GET,
          .params.composition_get.page_number = 0x00,
      },
      {
          .type = CONF_STEP_TYPE_APPKEY_ADD,
          .params.appkey_add.netkey_index = APP_NETKEY_IDX,
          .params.appkey_add.appkey_index = APP_APPKEY_IDX,
          .params.appkey_add.appkey = app_state.persistent.network.appkey,
      },
      {
          .type = CONF_STEP_TYPE_MODEL_APP_BIND,
          .params.model_app_bind.element_addr = 0x00,
          .params.model_app_bind.model_id.company_id = ACCESS_COMPANY_ID_NONE,
          .params.model_app_bind.model_id.model_id = HEALTH_SERVER_MODEL_ID,
          .params.model_app_bind.appkey_index = APP_APPKEY_IDX,
      },
      {
          .type = CONF_STEP_TYPE_MODEL_PUBLICATION_SET,
          .params.model_publication_set.element_addr = 0x00,
          .params.model_publication_set.model_id.company_id =
              ACCESS_COMPANY_ID_NONE,
          .params.model_publication_set.model_id.model_id =
              HEALTH_SERVER_MODEL_ID,
          .params.model_publication_set.publish_address.type =
              NRF_MESH_ADDRESS_TYPE_GROUP,
          .params.model_publication_set.publish_address.value = 0x0001,
          .params.model_publication_set.appkey_index = APP_APPKEY_IDX,
          .params.model_publication_set.publish_ttl = 1,
          .params.model_publication_set.publish_period.step_num = 1,
          .params.model_publication_set.publish_period.step_res =
              ACCESS_PUBLISH_RESOLUTION_1S,
      },
      {
          .type = CONF_STEP_TYPE_DONE,
      }};

  steps[2].params.model_app_bind.element_addr = addr;
  steps[3].params.model_app_bind.element_addr = addr;

  conf_start(addr, steps);
}

static void prov_failure_cb() { prov_start_scan(); }

static void conf_success_cb(uint16_t addr) { prov_start_scan(); }

static void conf_failure_cb(uint16_t addr) { prov_start_scan(); }

static void start() {
  APP_ERROR_CHECK(mesh_stack_start());
  LOG_INFO("Mesh stack started.");

  app_state_init();

  if (mesh_stack_is_device_provisioned()) {
    nrf_gpio_pin_set(PIN_LED_INDICATION);

    LOG_ERROR("We have already been provisioned. ");

    nrf_gpio_pin_set(PIN_LED_INDICATION);
    nrf_gpio_cfg_input(8, NRF_GPIO_PIN_PULLDOWN);
    bool should_reset = (nrf_gpio_pin_read(8) != 0);

    if (should_reset) {
      LOG_ERROR("Will clear all config and reset in 1s. ");

      mesh_stack_config_clear();
      nrf_delay_ms(1000);
      mesh_stack_device_reset();
      while (1) {
      }
    } else {
      LOG_ERROR("Will reuse the existing network config. ");
      app_state_load();
    }
  } else {
    app_state_clear();
  }

  prov_init(&app_state, prov_success_cb, prov_failure_cb);
  conf_init(&app_state, conf_success_cb, conf_failure_cb);

  prov_start_scan();
}

int main(void) {
  DEBUG_PINS_INIT();

  init_leds();
  init_logging();
  init_mesh();

  start();

  while (true) {
    (void) sd_app_evt_wait();
  }
}
